app/Controllers/AuthController.php

SELECT `manager_id`, `username`, `email`, `organization_id`, `role`
FROM `epos_managers`
WHERE `username` = 'cpaneladmin'
AND `password` = '81dc9bdb52d04dc20036dbd8313ed055'
AND `deleted` = 0
 LIMIT 1
---
    public function login() {
        $Manager = new Manager();

        try {
            $jsonData = request()->getJSON(true);
            $username = $jsonData['username'];
            $password = md5($jsonData["password"]);

            $user = $Manager->where("username", $username)
                ->where("password",$password)
                ->where("deleted", 0)
                ->select('manager_id,username,email,organization_id,role')
                ->first();