app/Controllers/BranchController.php

SELECT *
FROM `epos_branches`
---
    public function all() {
        try {
            $model = new Branch();
            $branches = $model->findAll();