app/Controllers/CategoryController.php

    public function all()
    {
        try {
            $model = new Category();
            $categories = $model->findAll();
---
SELECT *
FROM `epos_categories`

    public function checkSequence() {
        try {
            $model = new Category();
            $count = $model->groupStart()
                    ->where('sequence', '')
                    ->orWhere('sequence IS NULL', null, false)
                ->groupEnd()
                ->where('parent_id', '0')
                ->countAllResults(false);
---
SELECT COUNT(*) AS `numrows`
FROM `epos_categories`
WHERE   (
`sequence` = ''
OR sequence IS NULL
 )
AND `parent_id` = '0'