app/Controllers/CmsController.php

    public function save($id=null) {
        $authUser = request()->fetchGlobal('user');

        $model = new Cms();
        $logModel = new ActivityLog();

        try {
            $jsonData = json_decode(request()->getBody(), true);

            // To save main Cms
            if(empty($id)) {
                $model->save([
                    ...$jsonData,
                    'editor' => $authUser['id'],
                    'deleted' => 0,
                ]);
                $id = $model->insertID();

                // To add activity_log
                $logModel->save([
                    'editor' => $authUser['id'],
                    'activity_model' => Cms::class,
                    'activity_model_id' => $id,
                    'activity_action' => 'create',
                    'organization_id' => $jsonData['organization_id'] ?? '',
                ]);
---
INSERT INTO `epos_activity_logs` (`editor`, `activity_model`, `activity_model_id`, `activity_action`, `organization_id`, `created_at`, `updated_at`) VALUES ('5000', 'App\\Models\\Cms', 243, 'create', '8', '2025-11-07 02:36:21', '2025-11-07 02:36:21')