app/Controllers/CmsTemplateController.php

SELECT *
FROM `epos_cms_templates`
WHERE `deleted` != 1
---
    public function all() {
        try {
            $model = new CmsTemplate();
            $templates = $model->where('deleted != 1')->findAll();