app/Controllers/OrganizationController.php

SELECT *
FROM `epos_organizations`
---
    public function all() {
        try {
            $authUser = request()->fetchGlobal('user');
            $model = new Organization();

            if($authUser['role'] != ManagerRole['superadmin']) {
                $model->where('id', $authUser['organization_id']);
            }

            $organizations = $model->findAll();