app/Models/Manager.php

SELECT *
FROM `epos_manager_has_permissions`
WHERE `manager_id` = '5000'
---
    public function getPermissions(&$manager) {
        $model = new ManagerHasPermission();
        $permissions = $model->where('manager_id', $manager['manager_id'])->findAll();